## Dados absolutos
    - Coleta diretamente da fonte sem nenhum outro tipo de manipulação ( soemnte contagem, ordenação)

## Dados relativos
    - Fácil entendimento par ajudar nas comparações entre quantidades
   **Porcentagem**
   
   **Índices**
   
   **Coeficientes**
   
   **Taxa**

In [18]:
import pandas as pd
import numpy as np

### Percentuais

In [19]:
df= pd.DataFrame({'emprego':['Administrador_bando_de_dados','programador','Arquiteto_redes'],
             'nova_jersei':[97350,82080,112840],
              'florida':[77140,71540,62310]
             })

In [20]:
df

                        emprego  nova_jersei  florida
0  Administrador_bando_de_dados        97350    77140
1                   programador        82080    71540
2               Arquiteto_redes       112840    62310

In [21]:
df

                        emprego  nova_jersei  florida
0  Administrador_bando_de_dados        97350    77140
1                   programador        82080    71540
2               Arquiteto_redes       112840    62310

In [27]:
df['%_nova_jersei'] = df['nova_jersei']/df['nova_jersei'].sum()*100
df['%_florida'] = df['florida']/df['florida'].sum()*100

In [28]:
df

,emprego,nova_jersei,florida,%_nova_jersei,%_florida
0,Administrador_bando_de_dados,97350,77140,33.308242,36.560974
1,programador,82080,71540,28.083621,33.906820
2,Arquiteto_redes,112840,62310,38.608136,29.532205

Exercicio

In [31]:
df_c = pd.read_csv('data/Bases de dados/census.csv')

In [33]:
df_c = df_c[['income','education']]

In [35]:
df_c.head()

   income   education
0   <=50K   Bachelors
1   <=50K   Bachelors
2   <=50K     HS-grad
3   <=50K        11th
4   <=50K   Bachelors

In [42]:
df_c.groupby(['income','education']).count()

Empty DataFrame
Columns: []
Index: [( <=50K,  10th), ( <=50K,  11th), ( <=50K,  12th), ( <=50K,  1st-4th), ( <=50K,  5th-6th), ( <=50K,  7th-8th), ( <=50K,  9th), ( <=50K,  Assoc-acdm), ( <=50K,  Assoc-voc), ( <=50K,  Bachelors), ( <=50K,  Doctorate), ( <=50K,  HS-grad), ( <=50K,  Masters), ( <=50K,  Preschool), ( <=50K,  Prof-school), ( <=50K,  Some-college), ( >50K,  10th), ( >50K,  11th), ( >50K,  12th), ( >50K,  1st-4th), ( >50K,  5th-6th), ( >50K,  7th-8th), ( >50K,  9th), ( >50K,  Assoc-acdm), ( >50K,  Assoc-voc), ( >50K,  Bachelors), ( >50K,  Doctorate), ( >50K,  HS-grad), ( >50K,  Masters), ( >50K,  Prof-school), ( >50K,  Some-college)]